
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第3节 数据标准 · gitbook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="mi">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-darcula.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-flexible-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-ancre-navigation/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../chapter2/2z.html" />
    
    
    <link rel="prev" href="2j.html" />
    

    
        <link rel="shortcut icon" href='../icon/home.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../icon/home.ico' type="image/x-icon">
    
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    常见问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter/rizhi.html">
            
                <a href="../chapter/rizhi.html">
            
                    
                    更新日志
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter/liucheng.html">
            
                <a href="../chapter/liucheng.html">
            
                    
                    快速使用流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter/ztjj.html">
            
                <a href="../chapter/ztjj.html">
            
                    
                    产品手册
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="1z.html">
            
                <a href="1z.html">
            
                    
                    第一章：治理平台
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1.1" data-path="1j.html">
            
                <a href="1j.html">
            
                    
                    第1节 数据资产
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.2" data-path="2j.html">
            
                <a href="2j.html">
            
                    
                    第2节 数据治理
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.1.3" data-path="3j.html">
            
                <a href="3j.html">
            
                    
                    第3节 数据标准
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../chapter2/2z.html">
            
                <a href="../chapter2/2z.html">
            
                    
                    第二章：开发平台
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.2.1" data-path="../chapter2/1j.html">
            
                <a href="../chapter2/1j.html">
            
                    
                    第1节 自助分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2.2" data-path="../chapter2/2j.html">
            
                <a href="../chapter2/2j.html">
            
                    
                    第2节 离线任务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2.3" data-path="../chapter2/3j.html">
            
                <a href="../chapter2/3j.html">
            
                    
                    第3节 实时任务
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../chapter3/3z.html">
            
                <a href="../chapter3/3z.html">
            
                    
                    第三章：API平台
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.3.1" data-path="../chapter3/1j.html">
            
                <a href="../chapter3/1j.html">
            
                    
                    第1节 API开发
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3.2" data-path="../chapter3/2j.html">
            
                <a href="../chapter3/2j.html">
            
                    
                    第2节 API管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3.3" data-path="../chapter3/3j.html">
            
                <a href="../chapter3/3j.html">
            
                    
                    第3节 API统计
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第3节 数据标准</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x8868;&#x6807;&#x51C6;"><a name="&#x8868;&#x6807;&#x51C6;" class="anchor-navigation-ex-anchor" href="#&#x8868;&#x6807;&#x51C6;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x8868;&#x6807;&#x51C6;</h2>
<h3 id="&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x7BA1;&#x7406;"><a name="&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x7BA1;&#x7406;" class="anchor-navigation-ex-anchor" href="#&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x7BA1;&#x7406;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x7BA1;&#x7406;</h3>
<p>&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x7BA1;&#x7406;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x5185;&#x5B58;&#x653E;&#x7684;&#x6570;&#x636E;&#x8D44;&#x4EA7;&#x7684;&#x57FA;&#x672C;&#x5C5E;&#x6027;&#x548C;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#xFF0C;&#x5728;&#x8BE5;&#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x53EF;&#x4EE5;&#x53C2;&#x4E0E;&#x6570;&#x636E;&#x52D8;&#x63A2;&#xFF0C;&#x7531;&#x6CBB;&#x7406;&#x5DE5;&#x4E3A;&#x6BCF;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#x8D44;&#x4EA7;&#x660E;&#x786E;&#x5176;&#x57FA;&#x672C;&#x5C5E;&#x6027;&#x548C;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#x3002;</p>
<p><img src="image-16.png" alt="alt text"></p>
<p>1&#x3001;&#x5F53;&#x9F20;&#x6807;&#x60AC;&#x505C;&#x5728;&#x201C;&#x5168;&#x90E8;&#x201D;&#x540E;&#x9762;&#x7684;+&#x53F7;&#x65F6;&#x53EF;&#x4EE5;&#x65B0;&#x589E;&#x81EA;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#xFF1B;</p>
<p>2&#x3001;&#x5F53;&#x9F20;&#x6807;&#x60AC;&#x505C;&#x5728;&#x5177;&#x4F53;&#x7684;&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x4E0A;&#x65F6;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x4E0B;&#x7684;&#x53D6;&#x503C;&#x4EE5;&#x53CA;&#x5220;&#x9664;&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x3002;&#x90E8;&#x5206;&#x7CFB;&#x7EDF;&#x5185;&#x7F6E;&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x4E0D;&#x53EF;&#x5220;&#x9664;&#xFF0C;&#x5305;&#x62EC;&#x4E3B;&#x9898;&#x57DF;&#x3001;&#x6765;&#x6E90;&#x7CFB;&#x7EDF;&#x3001;&#x6570;&#x636E;&#x5206;&#x5C42;&#x3001;&#x66F4;&#x65B0;&#x9891;&#x7387;&#x3001;&#x90E8;&#x6807;&#x5206;&#x7C7B;&#x3001;&#x6570;&#x636E;&#x5143;&#x6807;&#x51C6;&#x3001;&#x9650;&#x5B9A;&#x8BCD;&#x6807;&#x51C6;&#xFF1B;</p>
<p>3&#x3001;&#x52D8;&#x63A2;&#x586B;&#x5199;&#x7EA6;&#x675F;&#xFF1A;&#x51B3;&#x5B9A;&#x5728;&#x6570;&#x636E;&#x52D8;&#x63A2;&#x65F6;&#x662F;&#x5426;&#x9700;&#x8981;&#x586B;&#x5199;&#x8BE5;&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x662F;&#x9009;&#x586B;&#x8FD8;&#x662F;&#x5FC5;&#x586B;&#x3002;&#x52D8;&#x63A2;&#x586B;&#x5199;&#x7EA6;&#x675F;&#x53EA;&#x6709;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#x53EF;&#x586B;&#xFF1B;</p>
<p>4&#x3001;&#x52D8;&#x63A2;&#x9884;&#x89C8;&#xFF1A;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x7F16;&#x8F91;&#x540E;&#x53EF;&#x4EE5;&#x70B9;&#x51FB;&#x52D8;&#x63A2;&#x9884;&#x89C8;&#x67E5;&#x770B;&#x6570;&#x636E;&#x52D8;&#x63A2;&#x9875;&#x9762;&#x9700;&#x8981;&#x586B;&#x5199;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x786E;&#x8BA4;&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x8BBE;&#x7F6E;&#x662F;&#x5426;&#x6709;&#x8BEF;&#x3002;</p>
<p><strong>&#x6570;&#x636E;&#x5206;&#x5C42;</strong>
&#x6570;&#x636E;&#x5206;&#x5C42;&#x8868;&#x793A;&#x6570;&#x636E;&#x4F4D;&#x4E8E;&#x6570;&#x4ED3;&#x7684;&#x54EA;&#x4E00;&#x5C42;&#x3002;&#x6570;&#x4ED3;&#x5206;&#x5C42;&#x662F;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x8BBE;&#x8BA1;&#x4E2D;&#x5341;&#x5206;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x73AF;&#x8282;&#xFF0C;&#x4F18;&#x79C0;&#x7684;&#x5206;&#x5C42;&#x8BBE;&#x8BA1;&#x80FD;&#x591F;&#x8BA9;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x4F53;&#x7CFB;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x548C;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5206;&#x4E3A;4&#x5C42;</p>
<p>&#x2460;&#x6570;&#x636E;&#x8FD0;&#x8425;&#x5C42;ODS&#xFF1A;&#x5B58;&#x653E;&#x7684;&#x662F;&#x63A5;&#x5165;&#x7684;&#x539F;&#x59CB;&#x6570;&#x636E;&#x3002;&#x7ECF;&#x8FC7;ETL&#x4E4B;&#x540E;&#x88C5;&#x5165;&#x672C;&#x5C42;&#xFF0C;&#x5927;&#x591A;&#x662F;&#x6309;&#x7167;&#x6E90;&#x5934;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x7684;&#x5206;&#x7C7B;&#x65B9;&#x5F0F;&#x800C;&#x5206;&#x7C7B;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x8003;&#x8651;&#x540E;&#x7EED;&#x53EF;&#x80FD;&#x8FFD;&#x6EAF;&#x6570;&#x636E;&#x4E3A;&#x9898;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x8FD9;&#x4E00;&#x5C42;&#x4E0D;&#x5EFA;&#x8BAE;&#x505A;&#x8FC7;&#x591A;&#x7684;&#x6570;&#x636E;&#x6E05;&#x6D17;&#x5DE5;&#x4F5C;&#xFF0C;&#x539F;&#x5C01;&#x4E0D;&#x52A8;&#x63A5;&#x5165;&#x6E90;&#x6570;&#x636E;&#x5373;&#x53EF;&#xFF0C;&#x81F3;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x53BB;&#x566A;&#xFF0C;&#x53BB;&#x91CD;&#xFF0C;&#x5F02;&#x5E38;&#x503C;&#x5904;&#x7406;&#x7B49;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x653E;&#x5728;&#x540E;&#x9762;&#x7684;DW&#x5C42;</p>
<p>&#x2461;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x5C42;DW&#xFF1A;&#x91CD;&#x70B9;&#x8BBE;&#x8BA1;&#x7684;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x4E2D;&#x95F4;&#x5C42;&#x6570;&#x636E;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;ODS&#x5C42;&#x83B7;&#x5F97;&#x7684;&#x6570;&#x636E;&#x6309;&#x7167;&#x4E3B;&#x9898;&#x5EFA;&#x7ACB;&#x5404;&#x79CD;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;DW&#x53C8;&#x7EC6;&#x5206; &#x2160;. &#x6570;&#x636E;&#x660E;&#x7EC6;&#x5C42;&#xFF1A;DWD(Data WareHouse Detail) &#x8BE5;&#x5C42;&#x4E00;&#x822C;&#x4FDD;&#x6301;&#x548C;ODS&#x5C42;&#x4E00;&#x6837;&#x7684;&#x6570;&#x636E;&#x7C92;&#x5EA6;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x7ED9;&#x4E00;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x8D28;&#x91CF;&#x4FDD;&#x8BC1;&#x3002;&#x540C;&#x65F6;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x6570;&#x636E;&#x660E;&#x7EC6;&#x5C42;&#x7684;&#x6613;&#x7528;&#x6027;&#xFF0C;&#x8BE5;&#x5C42;&#x4F1A;&#x91C7;&#x7528;&#x4E00;&#x4E9B;&#x7EF4;&#x5EA6;&#x9000;&#x5316;&#x624B;&#x6CD5;&#xFF0C;&#x5C06;&#x7EF4;&#x5EA6;&#x9000;&#x5316;&#x5230;&#x4E8B;&#x5B9E;&#x8868;&#x4E2D;&#xFF0C;&#x51CF;&#x5C11;&#x4E8B;&#x5B9E;&#x8868;&#x548C;&#x7EF4;&#x5EA6;&#x8868;&#x7684;&#x5173;&#x8054;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5728;&#x8BE5;&#x5C42;&#x4E5F;&#x4F1A;&#x505A;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x6570;&#x636E;&#x805A;&#x5408;&#xFF0C;&#x5C06;&#x76F8;&#x540C;&#x4E3B;&#x9898;&#x7684;&#x6570;&#x636E;&#x6C47;&#x96C6;&#x5230;&#x4E00;&#x5F20;&#x8868;&#x4E2D;&#xFF0C;&#x63D0;&#x9AD8;&#x6570;&#x636E;&#x7684;&#x53EF;&#x7528;&#x6027; &#x2161;. &#x6570;&#x636E;&#x4E2D;&#x95F4;&#x5C42;&#xFF1A;DWM&#xFF08;Data WareHouse Middle&#xFF09; &#x5728;DWD&#x5C42;&#x7684;&#x6570;&#x636E;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x505A;&#x8F7B;&#x5EA6;&#x7684;&#x805A;&#x5408;&#x64CD;&#x4F5C;&#xFF0C;&#x751F;&#x6210;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x4E2D;&#x95F4;&#x8868;&#x63D0;&#x5347;&#x516C;&#x5171;&#x6307;&#x6807;&#x7684;&#x590D;&#x7528;&#x6027;&#xFF0C;&#x51CF;&#x5C11;&#x91CD;&#x590D;&#x52A0;&#x5DE5;&#xFF0C;&#x76F4;&#x89C2;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x5BF9;&#x901A;&#x7528;&#x7684;&#x6838;&#x5FC3;&#x7EF4;&#x5EA6;&#x8FDB;&#x884C;&#x805A;&#x5408;&#x64CD;&#x4F5C;&#xFF0C;&#x7B97;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x7EDF;&#x8BA1;&#x6307;&#x6807; &#x2162;. &#x6570;&#x636E;&#x670D;&#x52A1;&#x5C42;&#xFF1A;DWS(Data WareHouse Service) &#x53C8;&#x79F0;&#x4E3A;&#x6570;&#x636E;&#x96C6;&#x5E02;&#x6216;&#x8005;&#x5BBD;&#x8868;&#xFF0C;&#x6309;&#x7167;&#x4E1A;&#x52A1;&#x5212;&#x5206;&#xFF0C;&#x4F8B;&#x5982;&#x6D41;&#x91CF;&#xFF0C;&#x8BA2;&#x5355;&#xFF0C;&#x7528;&#x6237;&#x7B49;&#xFF0C;&#x751F;&#x6210;&#x5B57;&#x6BB5;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x5BBD;&#x8868;&#xFF0C;&#x7528;&#x4E8E;&#x540E;&#x7EED;&#x7684;&#x4E1A;&#x52A1;&#x67E5;&#x8BE2;&#xFF0C;OLAP&#x5206;&#x6790;&#xFF0C;&#x6570;&#x636E;&#x5206;&#x6790;&#x7B49;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x9645;&#x8BA1;&#x7B97;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x76F4;&#x63A5;&#x4ECE;DWD&#x6216;&#x8005;ODS&#x8BA1;&#x7B97;&#x5BBD;&#x8868;&#x7684;&#x7EDF;&#x8BA1;&#x6307;&#x6807;&#xFF0C;&#x4F1A;&#x5B58;&#x5728;&#x8BA1;&#x7B97;&#x91CF;&#x592A;&#x5927;&#x5E76;&#x4E14;&#x7EF4;&#x5EA6;&#x592A;&#x5C11;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E00;&#x822C;&#x505A;&#x6CD5;&#x662F;&#x3002;&#x5728;DWM&#x5C42;&#x5148;&#x8BA1;&#x7B97;&#x51FA;&#x591A;&#x4E2A;&#x5C0F;&#x7684;&#x4E2D;&#x95F4;&#x8868;&#xFF0C;&#x518D;&#x62FC;&#x63A5;&#x6210;&#x4E00;&#x5F20;DWS&#x7684;&#x5927;&#x5BBD;&#x8868;&#x3002;&#x7531;&#x4E8E;&#x5BBD;&#x548C;&#x7A84;&#x7684;&#x754C;&#x9650;&#x4E0D;&#x6613;&#x754C;&#x5B9A;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x53BB;&#x6389;DWM&#x8FD9;&#x4E00;&#x5C42;&#xFF0C;&#x53EA;&#x4FDD;&#x7559;DWS&#x5C42;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x653E;&#x5728;DWS&#x4EA6;&#x53EF; &#x4E00;&#x822C;&#x91C7;&#x7528;&#x7EF4;&#x5EA6;&#x6A21;&#x578B;&#x65B9;&#x6CD5;&#x4F5C;&#x4E3A;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x91C7;&#x7528;&#x4E00;&#x4E9B;&#x7EF4;&#x5EA6;&#x9000;&#x5316;&#x624B;&#x6CD5;&#xFF0C;&#x5C06;&#x7EF4;&#x5EA6;&#x9000;&#x5316;&#x81F3;&#x4E8B;&#x5B9E;&#x8868;&#x4E2D;&#xFF0C;&#x51CF;&#x5C11;&#x7EF4;&#x5EA6;&#x8868;&#x4E0E;&#x4E8B;&#x5B9E;&#x8868;&#x7684;&#x5173;&#x8054;&#xFF0C;&#x63D0;&#x9AD8;&#x660E;&#x7EC6;&#x6570;&#x636E;&#x8868;&#x7684;&#x6613;&#x7528;&#x6027;&#xFF1B;&#x540C;&#x65F6;&#x5728;&#x6C47;&#x603B;&#x6570;&#x636E;&#x5C42;&#x8981;&#x52A0;&#x5F3A;&#x6307;&#x6807;&#x7684;&#x7EF4;&#x5EA6;&#x9000;&#x5316;&#xFF0C;&#x91C7;&#x7528;&#x66F4;&#x591A;&#x7684;&#x5BBD;&#x8868;&#x5316;&#x624B;&#x6BB5;&#x6784;&#x5EFA;&#x516C;&#x5171;&#x6307;&#x6807;&#x6570;&#x636E;&#x5C42;&#xFF0C;&#x63D0;&#x5347;&#x516C;&#x5171;&#x6307;&#x6807;&#x7684;&#x590D;&#x7528;&#x6027;&#xFF0C;&#x51CF;&#x5C11;&#x91CD;&#x590D;&#x52A0;&#x5DE5;</p>
<p>&#x4F8B;&#x5982;&#xFF1A; &#x8868;1&#xFF1A; &#x59D3;&#x540D;&#xFF0C;&#x57CE;&#x5E02;&#xFF0C;&#x5E74;&#x9F84; &#x8868;2&#xFF1A; &#x59D3;&#x540D;&#xFF0C;&#x8BA2;&#x5355;&#xFF0C;&#x8BA2;&#x5355;&#x91D1;&#x989D;</p>
<p>&#x9000;&#x5316;&#x6210;&#x5BBD;&#x8868;&#xFF1A; &#x59D3;&#x540D;&#xFF0C;&#x57CE;&#x5E02;&#xFF0C;&#x5E74;&#x9F84;&#xFF0C;&#x8BA2;&#x5355;&#xFF0C;&#x8BA2;&#x5355;&#x91D1;&#x989D;</p>
<p>&#x7EF4;&#x5EA6;&#x9000;&#x5316;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x628A;&#x7EF4;&#x5EA6;&#x5BF9;&#x5E94;&#x7684;&#x63CF;&#x8FF0;&#x76F4;&#x63A5;&#x653E;&#x5728;&#x4E8B;&#x5B9E;&#x8868;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x65F6;&#x4E0D;&#x518D;&#x5173;&#x8054;&#x7EF4;&#x5EA6;&#x8868;&#xFF0C;&#x628A;&#x8868;&#x505A;&#x5BBD;&#xFF0C;&#x67E5;&#x8BE2;&#x66F4;&#x65B9;&#x4FBF;</p>
<p>&#x2462;&#x6570;&#x636E;&#x5E94;&#x7528;&#x5C42;APP&#xFF1A;&#x9762;&#x5411;&#x4E1A;&#x52A1;&#x5B9A;&#x5236;&#x7684;&#x5E94;&#x7528;&#x6570;&#x636E; &#x4E3B;&#x8981;&#x63D0;&#x4F9B;&#x7ED9;&#x6570;&#x636E;&#x94F2;&#x5E73;&#x548C;&#x6570;&#x636E;&#x5206;&#x6790;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x653E;&#x5728;ES&#x3001;MYSQL&#x3001;Redis&#x7B49;&#x7CFB;&#x7EDF;&#x4F9B;&#x7EBF;&#x4E0A;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x653E;&#x5728;Hive&#x4E2D;&#x4F9B;&#x6570;&#x636E;&#x5206;&#x6790;&#x548C;&#x6570;&#x636E;&#x6316;&#x6398;&#x4F7F;&#x7528;</p>
<p>&#x2463;&#x7EF4;&#x8868;&#x5C42; Dimension 1&#x3001;&#x9AD8;&#x57FA;&#x6570;&#x7EF4;&#x5EA6;&#x6570;&#x636E;&#xFF1A;&#x4E00;&#x822C;&#x662F;&#x7528;&#x6237;&#x8D44;&#x6599;&#x8868;&#xFF0C;&#x5546;&#x54C1;&#x8D44;&#x6599;&#x8868;&#x7C7B;&#x4F3C;&#x7684;&#x8D44;&#x6599;&#x8868;&#x3002;&#x6570;&#x636E;&#x91CF;&#x53EF;&#x80FD;&#x662F;&#x5343;&#x4E07;&#x7EA7;&#x6216;&#x8005;&#x4E0A;&#x4EBF;&#x7EA7;&#x522B; 2&#x3001;&#x4F4E;&#x57FA;&#x6570;&#x7EF4;&#x5EA6;&#x6570;&#x636E;&#xFF1A;&#x4E00;&#x822C;&#x662F;&#x914D;&#x7F6E;&#x8868;&#xFF0C;&#x6BD4;&#x5982;&#x679A;&#x4E3E;&#x503C;&#x5BF9;&#x5E94;&#x7684;&#x4E2D;&#x6587;&#x542B;&#x4E49;&#xFF0C;&#x6216;&#x8005;&#x65E5;&#x671F;&#x7EF4;&#x8868;&#x3002;&#x6570;&#x636E;&#x91CF;&#x53EF;&#x80FD;&#x662F;&#x4E2A;&#x4F4D;&#x6570;&#x6216;&#x8005;&#x51E0;&#x5343;&#x51E0;&#x4E07;</p>
<p><strong>&#x6765;&#x6E90;&#x7CFB;&#x7EDF;</strong>
&#x6765;&#x6E90;&#x7CFB;&#x7EDF;&#x8868;&#x793A;&#x6570;&#x636E;&#x6765;&#x6E90;&#x4E8E;&#x54EA;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x4F8B;&#x5982;CRM&#x7CFB;&#x7EDF;&#x3001;&#x8BA2;&#x5355;&#x7CFB;&#x7EDF;&#x7B49;&#x3002;&#x4E00;&#x822C;&#x5728;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x6784;&#x5EFA;&#x4E4B;&#x521D;&#xFF0C;&#x9700;&#x8981;&#x68B3;&#x7406;&#x6570;&#x636E;&#x90FD;&#x6765;&#x81EA;&#x4E8E;&#x54EA;&#x4E9B;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x3001;&#x5404;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x53E3;&#x5F84;&#x7B49;&#x3002;</p>
<p><strong>&#x66F4;&#x65B0;&#x9891;&#x7387;</strong>
&#x66F4;&#x65B0;&#x9891;&#x7387;&#x6307;&#x6570;&#x636E;&#x7684;&#x66F4;&#x65B0;&#x9891;&#x7387;&#xFF0C;&#x79BB;&#x7EBF;&#x573A;&#x666F;&#x4E0B;&#x5E38;&#x89C1;&#x7684;&#x66F4;&#x65B0;&#x9891;&#x7387;&#x4E3A;&#x6BCF;&#x5929;&#x66F4;&#x65B0;&#x3001;&#x6BCF;&#x5468;&#x66F4;&#x65B0;&#x3001;&#x6BCF;&#x6708;&#x66F4;&#x65B0;&#xFF0C;&#x5B9E;&#x65F6;&#x573A;&#x666F;&#x4E0B;&#x5E38;&#x89C1;&#x7684;&#x66F4;&#x65B0;&#x9891;&#x7387;&#x4E3A;&#x5B9E;&#x65F6;&#x66F4;&#x65B0;&#x3001;&#x6BCF;&#x5C0F;&#x65F6;&#x66F4;&#x65B0;&#x3002;&#x66F4;&#x65B0;&#x9891;&#x7387;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x3002;</p>
<h3 id="&#x6807;&#x7B7E;&#x7BA1;&#x7406;"><a name="&#x6807;&#x7B7E;&#x7BA1;&#x7406;" class="anchor-navigation-ex-anchor" href="#&#x6807;&#x7B7E;&#x7BA1;&#x7406;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6807;&#x7B7E;&#x7BA1;&#x7406;</h3>
<p>&#x6807;&#x7B7E;&#x7528;&#x4E8E;&#x5BF9;&#x8D44;&#x4EA7;&#x8FDB;&#x884C;&#x6807;&#x8BB0;&#xFF0C;&#x4E00;&#x4EFD;&#x8D44;&#x4EA7;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x5F53;&#x5728;&#x8D44;&#x4EA7;&#x5730;&#x56FE;&#x67E5;&#x627E;&#x8D44;&#x4EA7;&#x65F6;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6807;&#x7B7E;&#x8FDB;&#x884C;&#x67E5;&#x627E;&#x3002;</p>
<p><img src="image-17.png" alt="alt text"></p>
<p>1&#x3001;&#x6570;&#x636E;&#x6807;&#x7B7E;&#x5236;&#x5B9A;&#xFF0C;&#x652F;&#x6301;&#x6811;&#x72B6;&#x6807;&#x7B7E;</p>
<p>2&#x3001;&#x7F16;&#x8F91;&#x6807;&#x7B7E;&#x540D;&#x79F0;</p>
<h2 id="&#x5B57;&#x6BB5;&#x6807;&#x51C6;"><a name="&#x5B57;&#x6BB5;&#x6807;&#x51C6;" class="anchor-navigation-ex-anchor" href="#&#x5B57;&#x6BB5;&#x6807;&#x51C6;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5B57;&#x6BB5;&#x6807;&#x51C6;</h2>
<h3 id="&#x5B57;&#x5178;&#x7BA1;&#x7406;"><a name="&#x5B57;&#x5178;&#x7BA1;&#x7406;" class="anchor-navigation-ex-anchor" href="#&#x5B57;&#x5178;&#x7BA1;&#x7406;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5B57;&#x5178;&#x7BA1;&#x7406;</h3>
<p>&#x5B57;&#x5178;&#x7528;&#x4E8E;&#x5BF9;&#x4E00;&#x4E9B;&#x5185;&#x90E8;&#x6709;&#x679A;&#x4E3E;&#x503C;&#x6216;&#x8005;&#x6709;&#x7F16;&#x7801;&#x7684;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x7FFB;&#x8BD1;&#x3002;&#x5982;&#x67D0;&#x4E2A;&#x5B57;&#x6BB5;&#x5185;&#x90E8;0&#x4EE3;&#x8868;&#x7537;&#x6027;&#xFF0C;1&#x4EE3;&#x8868;&#x5973;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;&#x5B57;&#x5178;&#xFF0C;&#x7528;&#x4E8E;&#x540E;&#x7EED;&#x7684;&#x7FFB;&#x8BD1;&#x3002;</p>
<p><img src="image-18.png" alt="alt text"></p>
<p>&#xFF08;1&#xFF09;&#x70B9;&#x51FB;&#x5B57;&#x5178;&#x6216;&#x5206;&#x7C7B;&#x540D;&#x79F0;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;</p>
<p>&#xFF08;2&#xFF09;&#x70B9;&#x51FB;&#x52A0;&#x53F7;&#x53EF;&#x9009;&#x62E9;&#x65B0;&#x5EFA;&#x5206;&#x7C7B;&#x6216;&#x65B0;&#x5EFA;&#x5B57;&#x5178;</p>
<h3 id="&#x5B57;&#x6BB5;&#x5C5E;&#x6027;&#x7BA1;&#x7406;"><a name="&#x5B57;&#x6BB5;&#x5C5E;&#x6027;&#x7BA1;&#x7406;" class="anchor-navigation-ex-anchor" href="#&#x5B57;&#x6BB5;&#x5C5E;&#x6027;&#x7BA1;&#x7406;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5B57;&#x6BB5;&#x5C5E;&#x6027;&#x7BA1;&#x7406;</h3>
<p><img src="image-19.png" alt="alt text"></p>
<p>&#x5B57;&#x6BB5;&#x5C5E;&#x6027;&#x7528;&#x4E8E;&#x5BF9;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x7C7B;&#x4F3C;&#x8D44;&#x4EA7;&#x5C5E;&#x6027;&#x5BF9;&#x8D44;&#x4EA7;&#x7684;&#x6807;&#x8BB0;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#xFF08;1&#xFF09;&#x65B0;&#x589E;&#x5C5E;&#x6027;</p>
<p>&#xFF08;2&#xFF09;&#x7F16;&#x8F91;&#x5C5E;&#x6027; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; www.sqlfans.cn 2021 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x66F4;&#x65B0;&#x65F6;&#x95F4;&#xFF1A;
2026-01-09 15:43:34
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2j.html" class="navigation navigation-prev " aria-label="Previous page: 第2节 数据治理">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../chapter2/2z.html" class="navigation navigation-next " aria-label="Next page: 第二章：开发平台">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第3节 数据标准","level":"1.4.1.3","depth":3,"next":{"title":"第二章：开发平台","level":"1.4.2","depth":2,"path":"chapter2/2z.md","ref":"chapter2/2z.md","articles":[{"title":"第1节 自助分析","level":"1.4.2.1","depth":3,"path":"chapter2/1j.md","ref":"chapter2/1j.md","articles":[]},{"title":"第2节 离线任务","level":"1.4.2.2","depth":3,"path":"chapter2/2j.md","ref":"chapter2/2j.md","articles":[]},{"title":"第3节 实时任务","level":"1.4.2.3","depth":3,"path":"chapter2/3j.md","ref":"chapter2/3j.md","articles":[]}]},"previous":{"title":"第2节 数据治理","level":"1.4.1.2","depth":3,"path":"chapter1/2j.md","ref":"chapter1/2j.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-sharing","-lunr","-search","search-pro","-highlight","prism@^2.1.0","prism-themes","-default-theme","theme-comscore","splitter","tbfed-pagefooter","expandable-chapters","hide-element","favicon","code","sectionx","flexible-alerts","ancre-navigation","pageview-count","livereload"],"root":".","styles":{"website":"styles/website.css","ebook":"styles/ebook.css","pdf":"styles/pdf.css","mobi":"styles/mobi.css","epub":"styles/epub.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy www.sqlfans.cn 2021","modify_label":"更新时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-darcula.css"]},"livereload":{},"splitter":{},"search-pro":{},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link",".lightbox"]},"pdf":{"pageNumbers":true,"fontFamily":"Arial","fontSize":12,"paperSize":"a4","margin":{"right":62,"left":62,"top":56,"bottom":56}},"fontsettings":{"theme":"white","family":"sans","size":2},"sectionx":{"tag":"b"},"favicon":{"shortcut":"icon/home.ico","bookmark":"icon/home.ico"},"theme-comscore":{},"pageview-count":{},"prism-themes":{},"ancre-navigation":{"associatedWithSummary":true,"float":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showLevel":true},"flexible-alerts":{"danger":{"className":"danger","icon":"fa fa-ban","label":"Attention"},"note":{"className":"info","icon":"fa fa-info-circle","label":"Note"},"style":"callout","tip":{"className":"tip","icon":"fa fa-lightbulb-o","label":"Tip"},"warning":{"className":"warning","icon":"fa fa-exclamation-triangle","label":"Warning"}},"theme-default":{"styles":{"pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css","website":"styles/website.css"},"showLevel":false},"expandable-chapters":{}},"theme":"default","author":"mi","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"gitbook","language":"zh-hans","output.name":"site","gitbook":"3.2.3"},"file":{"path":"chapter1/3j.md","mtime":"2026-01-09T07:43:34.606Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2026-01-13T08:50:19.618Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-flexible-alerts/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

